Courses/7140/Lectures/Examples/Editor/open-source-edtors.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Open Source Text/Programmer Editors</title>
<!-- 2015-07-25 Sat 16:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="WSU CS 7140 Advanced Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../Top/">CS 7140</a> 2015-06-01
</div>
<div id="content">
<h1 class="title">Open Source Text/Programmer Editors</h1>
<ol class="org-ol">
<li>This list is not meant to be exahaustive.  But relevant to our
learning goals.
</li>

<li>EMACS <a href="http://www.gnu.org/software/emacs/">http://www.gnu.org/software/emacs/</a> "GNU Emacs is an
extensible, customizable text editor &#x2013; and more. At its core is an
interpreter for Emacs Lisp, a dialect of the Lisp programming
language with extensions to support text editing."  The current
stable release is 24.5 (April 2015)
</li>

<li>Vi <a href="http://ex-vi.sourceforge.net/">http://ex-vi.sourceforge.net/</a> The Traditional Vi Source Code for
Modern Unix Systems
</li>

<li>MS NotePad
<a href="https://msdn.microsoft.com/en-us/library/vstudio/aa972157">https://msdn.microsoft.com/en-us/library/vstudio/aa972157</a> "This
sample is a full featured Windows Notepad application with some
added features &#x2026;"
</li>

<li>MicroEmacs URL TBD
</li>

<li>A quick to read review of "new style" editors named
<code>sublime-text, atom, brackets, light-table</code>:
<a href="http://www.sitepoint.com/sitepoint-smackdown-atom-vs-brackets-vs-light-table-vs-sublime-text/">http://www.sitepoint.com/sitepoint-smackdown-atom-vs-brackets-vs-light-table-vs-sublime-text/</a>
"A new breed of editor has arrived. It fills the gaping void
between basic text applications (Notepad, TextEdit, gedit, etc.)
and full Integrated Development Environments (VisualStudio,
Eclipse, NetBeans etc.) Simpler applications lack basic development
requirements such as multiple documents, line numbering and code
coloring. IDEs tend to be monolithic applications which cater for a
specific language, framework or platform." &#x2026;
"Sorry Vi[m] and Emacs fans — console-based applications have been excluded"
September 3, 2014 

<p>
Not by an academic. Certainly <b>not</b> thorough.
</p>
</li>

<li><a href="https://github.com/scaled/scaled">https://github.com/scaled/scaled</a> "Scaled is a modern programmer's
text editor, built atop Java 8 and JavaFX 8, mostly written in
Scala, &#x2026;  Scaled focuses on the text editing experience first,
and IDE-like features second. &#x2026; Scaled is designed to be
extensible in any JVM language." 

<p>
Active project June 2015.
</p>
</li>
</ol>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2015 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2015-06-01
</div>
</body>
</html>
